# Задание 1: Приветствие
#Цель: Научиться получать данные от пользователя с помощью input() и
#выводить форматированный текст, объединяя строки и переменные.
#Описание задания: Напишите программу, которая сначала спрашивает у
#пользователя его имя, а затем выводит персональное приветствие, используя это имя.
name = input("Как тебя зовут? ")
print(f"Привет, {name}! Приятно познакомиться.")
